/* virtioHostBlock.c - virtio block host device */

/*
 * Copyright (c) 2022-2023 Wind River Systems, Inc.
 *
 * The right to copy, distribute, modify or otherwise make use
 * of this software may be licensed only pursuant to the terms
 * of an applicable Wind River license agreement.
 */

/*
   DESCRIPTION

   This is the application that supply a virtio blk host driver, it provides
   the back-end storage media support for the reading and writing functions
   of virtio-block device on the host VM.
 */

#include <unistd.h>
#include <stdio.h>
#include <pthread.h>
#include <semaphore.h>
#include <errno.h>
#include <string.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stddef.h>
#include <sys/queue.h>
#include <linux/virtio_blk.h>
#include "virtio_host_lib.h"

#undef VIRTIO_BLK_PERF

#ifdef VIRTIO_BLK_PERF
/* FIXME: add functions for the time measurements */
#include <linux/timex.h>
#endif

#define VIRTIO_BLK_DEV_DBG_ON
#ifdef VIRTIO_BLK_DEV_DBG_ON

#define VIRTIO_BLK_DEV_DBG_OFF             0x00000000
#define VIRTIO_BLK_DEV_DBG_ISR             0x00000001
#define VIRTIO_BLK_DEV_DBG_ARGS            0x00000020
#define VIRTIO_BLK_DEV_DBG_ERR             0x00000100
#define VIRTIO_BLK_DEV_DBG_INFO            0x00000200
#define VIRTIO_BLK_DEV_DBG_ALL             0xffffffff

static uint32_t virtioBlkDevDbgMask = VIRTIO_BLK_DEV_DBG_ERR;

#define VIRTIO_BLK_DEV_DBG(mask, fmt, ...)				\
	do {								\
		if ((virtioBlkDevDbgMask & (mask)) ||			\
		    ((mask) == VIRTIO_BLK_DEV_DBG_ALL)) {		\
			printf("%d: %s() " fmt, __LINE__, __func__,	\
			       ##__VA_ARGS__);				\
		}							\
	}								\
while ((false));
#else
#define VIRTIO_BLK_DEV_DBG(...)
#endif  /* VIRTIO_BLK_DEV_DBG_ON */


#define VIRTIO_BLK_DRV_NAME         "virtio-block-host"

#define VIRTIO_BLK_QUEUE_MAX        1     /* block device only has one queue */
#define VIRTIO_BLK_QUEUE_MAX_NUM    2048  /* max number of descriptors in a queue*/
#define VIRTIO_BLK_DISK_ID_BYTES    20

#define BLOCK_IO_REQ_MAX            256//256
#define VIRTIO_BLK_SIZE             512

#define VIRTIO_BLK_HOST_DEV_MAX     30

/* feature */
#define HEX_CODE_CHECK(s, mode)                                                \
	do {                                                                   \
		if ((s[0] == '0') && ((s[1] == 'x') || (s[1] == 'X')))         \
		{                                                              \
			mode = 16;                                             \
		}                                                              \
		else                                                           \
		{                                                              \
			mode = 10;                                             \
		}                                                              \
	} while (0)

enum virtioBlkOpType {
	BLK_OP_READ,
	BLK_OP_WRITE,
	BLK_OP_FLUSH,
	BLK_OP_DISCARD
};

struct virtioBlkConfig {
	uint64_t         capacity;                   /* 0x00 */
	uint32_t         size_max;                   /* 0x08 */
	uint32_t         seg_max;                    /* 0x0c */
	struct {
		uint16_t cylinders;                  /* 0x10 */
		uint8_t  heads;                      /* 0x12 */
		uint8_t  sectors;                    /* 0x13 */
	} geometry;
	uint32_t         blk_size;                   /* 0x14 */
	struct {
		uint8_t  physical_block_exp;         /* 0x15 */
		uint8_t  alignment_offset;           /* 0x16 */
		uint16_t min_io_size;                /* 0x18 */
		uint32_t opt_io_size;                /* 0x1c */
	} topology;
	uint8_t          writeback;                  /* 0x20 */
	uint8_t          unused;                     /* 0x21 */
	uint16_t         num_queues;                 /* 0x22 */
	uint32_t         max_discard_sectors;        /* 0x24 */
	uint32_t         max_discard_seg;            /* 0x28 */
	uint32_t         discard_sector_alignment;   /* 0x2c */
	uint32_t         max_write_zeroes_sectors;
	uint8_t          write_zeroes_may_unmap;
	uint8_t          unused1[3];
	uint32_t         max_secure_erase_sectors;
	uint32_t         max_secure_erase_seg;
	uint32_t         secure_erase_sector_alignment;
} __attribute__((packed));

struct virtioBlkReqHdr {                 /* fixed-size block header */
	uint32_t type;
	uint32_t reserved;
	uint64_t sector;
#ifdef VIRTIO_BLK_PERF
	uint64_t time1;
	uint64_t time2;
	uint64_t time3;
	uint64_t time4;
	uint64_t time5;
#endif
	uint8_t status;
} __attribute__((packed));

struct virtioBlkIoReq {                  /* virtio block I/O request */
	TAILQ_ENTRY(virtioBlkIoReq) node;
	struct virtioBlkHostCtx *blkHostCtx;
	struct virtioHostBuf bufList[BLOCK_IO_REQ_MAX];
	int bufcnt;
	uint16_t idx;
	uint64_t offset;
	size_t len;
	uint8_t *pStatus;
	enum virtioBlkOpType opType;
	struct virtioBlkReqHdr *pReqHdr;
};

struct virtioBlkHostDev {
