/* virtioHostBlock.c - virtio block host device */

/*
 * Copyright (c) 2024, Wind River Systems, Inc.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/*
   DESCRIPTION

   This is the application that supply a virtio blk host driver, it provides
   the back-end storage media support for the reading and writing functions
   of virtio-block device on the host VM.
 */

#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <stddef.h>
#include <pthread.h>
#include <semaphore.h>
#include <string.h>
#include <stdbool.h>
#include <errno.h>
#include <fcntl.h>
#include <syslog.h>
#include <sys/types.h>
#include <sys/param.h>
#include <sys/ioctl.h>
#include <sys/stat.h>
#include <sys/uio.h>
#include <openssl/md5.h>
#if OPENSSL_VERSION_NUMBER >= 0x30000000L
#include <openssl/evp.h>
#endif
#include <linux/fs.h>
#include <linux/virtio_blk.h>
#include "virtioHostLib.h"

/* #define VIRTIO_BLK_PERF */
#ifdef VIRTIO_BLK_PERF
/* #include <time.h> */
#endif

#define VIRTIO_BLK_DEV_DBG_ON
#ifdef VIRTIO_BLK_DEV_DBG_ON

#define VIRTIO_BLK_DEV_DBG_OFF             0x00000000
#define VIRTIO_BLK_DEV_DBG_ISR             0x00000001
#define VIRTIO_BLK_DEV_DBG_ARGS            0x00000020
#define VIRTIO_BLK_DEV_DBG_ERR             0x00000100
#define VIRTIO_BLK_DEV_DBG_INFO            0x00000200
#define VIRTIO_BLK_DEV_DBG_ALL             0xffffffff

static uint32_t virtioBlkDevDbgMask = VIRTIO_BLK_DEV_DBG_ALL;

#undef VIRTIO_BLK_DEV_DBG
#undef VIRTIO_BLK_DEV_DBG_PRINTF

#ifdef VIRTIO_BLK_DEV_DBG_PRINTF
#define VIRTIO_BLK_DEV_DBG(mask, fmt, ...)				\
	do {								\
		if ((virtioBlkDevDbgMask & (mask)) ||			\
		    ((mask) == VIRTIO_BLK_DEV_DBG_ALL)) {		\
			printf("%d: %s() " fmt, __LINE__, __func__,	\
			       ##__VA_ARGS__);				\
		}							\
	}								\
while ((false))
#else
#define VIRTIO_BLK_DEV_DBG(mask, fmt, ...)				\
	do {								\
		if ((virtioBlkDevDbgMask & (mask)) ||			\
		    ((mask) == VIRTIO_BLK_DEV_DBG_ALL)) {		\
			syslog(LOG_ERR, "%d: %s() " fmt, __LINE__, __func__, \
				##__VA_ARGS__);				\
		}							\
	}								\
while ((false))
#endif

#else
#define VIRTIO_BLK_DEV_DBG(...)
#endif  /* VIRTIO_BLK_DEV_DBG_ON */


#define VIRTIO_BLK_DRV_NAME         "virtio-block-host"

#define VIRTIO_BLK_QUEUE_MAX     1     /* block device only has one queue */
#define VIRTIO_BLK_QUEUE_MAX_NUM 2048  /* max number of descriptors in a queue*/
#define VIRTIO_BLK_DISK_ID_BYTES 20

#define BLOCK_IO_REQ_MAX         256
#define VIRTIO_BLK_SIZE          512

#define VIRTIO_BLK_HOST_DEV_MAX  30

enum virtioBlkOpType {
	BLK_OP_READ,
	BLK_OP_WRITE,
	BLK_OP_FLUSH,
	BLK_OP_DISCARD
};

struct virtioBlkConfig {
	uint64_t         capacity;                   /* 0x00 */
	uint32_t         size_max;                   /* 0x08 */
	uint32_t         seg_max;                    /* 0x0c */
	struct {
		uint16_t cylinders;                  /* 0x10 */
		uint8_t  heads;                      /* 0x12 */
		uint8_t  sectors;                    /* 0x13 */
	} geometry;
	uint32_t         blk_size;                   /* 0x14 */
	struct {
		uint8_t  physical_block_exp;         /* 0x15 */
		uint8_t  alignment_offset;           /* 0x16 */
		uint16_t min_io_size;                /* 0x18 */
		uint32_t opt_io_size;                /* 0x1c */
	} topology;
	uint8_t          writeback;                  /* 0x20 */
	uint8_t          unused;                     /* 0x21 */
	uint16_t         num_queues;                 /* 0x22 */
	uint32_t         max_discard_sectors;        /* 0x24 */
	uint32_t         max_discard_seg;            /* 0x28 */
	uint32_t         discard_sector_alignment;   /* 0x2c */
	uint32_t         max_write_zeroes_sectors;
	uint8_t          write_zeroes_may_unmap;
	uint8_t          unused1[3];
	uint32_t         max_secure_erase_sectors;
	uint32_t         max_secure_erase_seg;
	uint32_t         secure_erase_sector_alignment;
} __attribute__((packed));

struct virtioBlkReqHdr {                 /* fixed-size block header */
	uint32_t type;
	uint32_t reserved;
	uint64_t sector;
#ifdef VIRTIO_BLK_PERF
	struct timespec time1;
	struct timespec time2;
	struct timespec time3;
	struct timespec time4;
	struct timespec time5;
#endif
	uint8_t status;
} __attribute__((packed));

struct virtioBlkIoReq {                  /* virtio block I/O request */
	struct virtioBlkHostCtx *blkHostCtx;
	struct virtioHostBuf bufList[BLOCK_IO_REQ_MAX];
	int bufcnt;
	uint16_t idx;
	uint64_t offset;
	size_t len;
	uint8_t *pStatus;
	enum virtioBlkOpType opType;
	struct virtioBlkReqHdr *pReqHdr;
};

struct virtioBlkHostDev {
